config/DataProcessors/ИмпортЭкспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИмпортЭкспорт</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

config/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/DataProcessors/ИмпортЭкспорт/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ИмпортНаСервере()
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать("D:\1c\import.txt");
	
	Для Строка = 1 По ТекстДок.КоличествоСтрок() Цикл
		
		// Товар
		Стр = ТекстДок.ПолучитьСтроку(Строка);
		ПозицияКонецТовар = Найти(Стр, ";");
		
		ОбработкаТЧ = Объект.ТЧ.Добавить();
		ОбработкаТЧ.Товар = Сред(Стр, 1, ПозицияКонецТовар - 1);
		
		// Количество
		Стр = Сред(Стр, ПозицияКонецТовар + 1);
		ПозицияКонецКол = Найти(Стр, ";");
		ОбработкаТЧ.Количество = Сред(Стр, 1, ПозицияКонецКол - 1);
		
		// Цена
		Стр = Сред(Стр, ПозицияКонецКол + 1);
		ОбработкаТЧ.Цена = Стр;
		
		НайденныйТовар = Справочники.Номенклатура.НайтиПоНаименованию(ОбработкаТЧ.Товар);		
		Если НайденныйТовар.Пустая() Тогда
			НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			НовыйЭлемент.Наименование = ОбработкаТЧ.Товар;
			НовыйЭлемент.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Импорт(Команда)
	ИмпортНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭкспортНаСервере()
	
	ПутьФайлаTXT = "D:\1c\export.txt";
	ТекстЗаписи = Новый ЗаписьТекста(ПутьФайлаTXT);
	
	Для каждого Строка из Объект.ТЧ Цикл
		ИтогСтрока = Строка.Товар + ";" + Строка.Цена + ";" + Строка.Количество;
		ТекстЗаписи.ЗаписатьСтроку(ИтогСтрока);
	КонецЦикла;           
	
	ТекстЗаписи.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортТЧ(Команда)
	ЭкспортНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокНаСервере()
	
	Док = Документы.ПриходнаяНакладная.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Склад = Справочники.Склады.Основной;
	
	ТЧ = Объект.ТЧ;
	Для каждого Стр из ТЧ Цикл
		ДокСтр = Док.ТЧ.Добавить();
		ДокСтр.Количество = Стр.Количество;

		НайденныйТовар = Справочники.Номенклатура.НайтиПоНаименованию(Стр.Товар);		
		Если Не НайденныйТовар.Пустая() Тогда
			ДокСтр.Номенклатура = НайденныйТовар;
		КонецЕсли;
	КонецЦикла;
	
	Док.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДок(Команда)
	СоздатьДокНаСервере();
КонецПроцедуры
